{
  "backend/main.mo": "Main Motoko actor implementing user profile management, daily totals storage with branch/user/date isolation, and access control integration using MixinAuthorization for permission checks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend source files including components for calculator, balance sheet, authentication, and print functionality.",
  "frontend/index.css": "Global CSS with Tailwind layers, OKLCH color system variables for light/dark modes, and print media queries to hide non-bill UI elements.",
  "frontend/index.html": "HTML entry point with title \"Varshini Classic Cuisine\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component with branch authentication gate, view mode switching (calculator/dailyTotals/optimizeBill), print view routing, error boundary wrapping, and startup failure handling.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches render errors and external startup errors, displaying CrashFallbackScreen on failure.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Authentication gate page requiring branch login with optional Internet Identity connection, shown before main app access.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Branch login form component with username/password inputs, validation, error handling, and submission state management using the useBranchAuth hook.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Displays current branch user and logout button when authenticated, using useBranchAuth hook to manage session state.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states, error handling, and automatic retry logic for authentication failures.",
  "frontend/src/components/CrashFallbackScreen.tsx": "Error fallback UI displaying error message with reload button for application crash recovery.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Notice bar component displaying draft link expiration warning with copy-to-clipboard button for current URL.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Main view for displaying daily revenue totals and item quantities with day selection, clear all functionality, and success/error feedback alerts.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Custom hook that manages daily total state, fetches balance sheet data from backend with localStorage fallback, and handles branch-scoped storage changes.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "Utility functions for managing branch-scoped daily ledger and summary data in localStorage, including loading, saving, clearing, and computing daily totals.",
  "frontend/src/features/calculator/billCode.ts": "Generates unique bill codes in format BILL-YYYYMMDD-HHMMSS-XXXX with timestamp and random alphanumeric suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines predefined catalog of menu items with prices, categories, and out-of-stock status for South Indian, North Indian, Rice, Curries, Snacks, Beverages, and Desserts.",
  "frontend/src/features/calculator/format.ts": "Provides currency and number formatting utilities using Intl.NumberFormat for INR currency with 2 decimal places.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Utilities for case-insensitive matching of catalog items to line items, finding duplicates, and calculating total added quantities.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "Catalog component for browsing, searching, and managing predefined items with categories, images, out-of-stock status, and quick-add functionality for bills.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "TypeScript interface definition for PredefinedItemCatalog component props including catalog items, line items, and callback handlers.",
  "frontend/src/features/calculator/PrintBill.tsx": "React component that renders a print-only bill layout with header, line items table, totals breakdown (subtotal, tax, discount, final total), and footer for Varshini Classic Cuisine.",
  "frontend/src/features/calculator/savedBills.ts": "Manages bill persistence to branch-scoped localStorage with functions to save, retrieve, list, and clear saved bill records including format snapshots.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page component managing line items, tax, discount, and catalog integration with features to add/remove items, save bills, update ledger, print, and reset state.",
  "frontend/src/features/calculator/types.ts": "TypeScript type definitions for LineItem, CalculatorState, and CalculationBreakdown interfaces used throughout the calculator feature.",
  "frontend/src/features/calculator/utils.ts": "Core calculation utilities for parsing numbers, clamping values, computing line totals, subtotals, and full breakdowns with tax and discount.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Utility function that reads an image file using FileReader and converts it to a base64 data URL string with validation.",
  "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts": "Utility that enforces fixed print location addresses for specific branch users (bachupally, nezampat) that cannot be changed by users or overridden by backend/localStorage values.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "Page component for configuring default bill format settings including receipt style, payment QR code image upload, and print location address with branch-specific fixed address support.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Manages loading and saving bill format defaults (receipt style, payment scan URL, print location) to branch-scoped localStorage, enforcing fixed print locations for specific branches.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines receipt style types ('classic' and 'compact') with their metadata and sets 'classic' as the default style.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook that loads bill format defaults from branch-scoped storage and provides a function to save them both locally and to the backend user profile, enforcing fixed print locations for specific branches.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "React hook that syncs bill print location from backend user profile to branch-scoped localStorage on authentication, skipping sync for fixed branch users to preserve their enforced addresses.",
  "frontend/src/features/print/PrintViewPage.tsx": "Page component that loads a saved bill from branch-scoped storage by ID and renders it for printing with auto-print functionality and manual print controls.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useBranchAuth.tsx": "React context provider and hook for branch-based authentication with hardcoded credentials (bachupally/nezampat), persisting login state to localStorage and triggering data migration on login/hydration.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "React hook that provides a function to copy the current page URL to clipboard with fallback support for older browsers and status tracking (idle/success/error).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing AuthClient creation, login flow, identity persistence, and providing authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, daily totals, and balance sheets using the actor from useActor hook.",
  "frontend/src/hooks/useStartupFailureHandlers.ts": "Custom hook that listens for unhandled promise rejections and errors during app startup, capturing them as startup error state.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and print media styles for optimized printing of tables and content.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/utils/branchScopedStorage.ts": "Provides branch-scoped localStorage utilities with namespaced keys per branch and handles one-time migration from legacy global storage keys.",
  "frontend/src/utils/confirmDelete.ts": "Utility functions for showing confirmation dialogs before deleting items or clearing all daily totals.",
  "frontend/src/utils/iiProviderShim.ts": "Shim that ensures a safe default Internet Identity provider URL is available, using Vite environment variables or falling back to production URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, border radius variables, and including animation and typography plugins.",
  "project_state.json": "Project state metadata indicating a pending feature request (AR-1) to remove the bill-related section from the balance sheet view."
}