{
  "backend/main.mo": "Motoko canister providing user profiles, per-user daily totals, and access-controlled CRUD functions with principal-scoped storage keys.",
  "feature_evidence.json": "Feature evidence report listing branch-specific fixed print‑location logic, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files including calculator, balance sheet, optimize bill, UI components, and infrastructure.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH color tokens with light/dark mode variables.",
  "frontend/index.html": "HTML entry point loading the React app with title 'Varshini Classic Cuisine'.",
  "frontend/src/App.tsx": "Main React app shell gating access by branch authentication, rendering calculator, daily totals, or optimize bill views, plus print‑mode handling.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Branch login gate UI with optional Internet Identity section and branded header/footer.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Branch login form handling username/password input, submission state, and error display.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Shows current branch user and provides a logout button when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button for Internet Identity with status handling and error messaging.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Top notice bar showing link‑expiry guidance and a copy‑URL button with success/error states.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "UI to select a day and display its total revenue and item quantities using daily totals data.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Hook that loads available days and daily totals from backend or localStorage and syncs updates.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "LocalStorage-based utilities for computing, storing, and retrieving daily ledger and summary data.",
  "frontend/src/features/calculator/billCode.ts": "Generates a unique bill code using timestamp and a random 4‑character suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines a predefined catalog of food items with prices and metadata.",
  "frontend/src/features/calculator/format.ts": "Provides helpers to format numbers and currency in INR style.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Matches catalog items to existing line items using normalized labels and computes added quantities.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "Catalog UI for searching, grouping, managing, and adding predefined items with optional images.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Type definitions for the predefined item catalog component’s props.",
  "frontend/src/features/calculator/PrintBill.tsx": "Renders a printable bill showing line items, subtotal, tax, discounts, and final total.",
  "frontend/src/features/calculator/savedBills.ts": "Handles saving, loading, and clearing bill records in branch‑scoped localStorage.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator UI managing line items, catalog additions, totals, bill saving, and printing.",
  "frontend/src/features/calculator/types.ts": "Defines TypeScript interfaces for line items, calculator state, and breakdown totals.",
  "frontend/src/features/calculator/utils.ts": "Contains helpers for parsing numbers, clamping, and calculating totals, tax, and discounts.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Reads an image file and returns its data URL or errors if invalid.",
  "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts": "Defines fixed print addresses for specific branches and utilities to check, retrieve, and enforce them.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "UI for configuring default receipt styles, payment image uploads, and print location settings.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Loads and saves bill format defaults in branch‑scoped localStorage, enforcing fixed print locations when applicable.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines available receipt style IDs, their metadata, and the default style.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook for reading and saving bill format defaults, enforcing fixed addresses and syncing updates to backend when logged in.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "React hook that syncs print location from backend profile to local defaults unless the branch has a fixed address.",
  "frontend/src/features/print/PrintViewPage.tsx": "Displays a saved bill for printing, loads it using branch context, and triggers auto or manual printing.",
  "frontend/src/hooks/useActor.ts": "Provides an authenticated or anonymous backend actor via Internet Identity and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useBranchAuth.tsx": "Implements simple branch‑level authentication with stored credentials and migrates legacy data on login or hydration.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Hook that copies the current page URL to the clipboard with success/error tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity handling login, stored identities, and exposing login status.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, daily totals, and balance sheet through the actor API.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, dark mode overrides, and print-specific styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/utils/branchScopedStorage.ts": "Handles branch-scoped localStorage keys and migration from legacy global keys.",
  "frontend/src/utils/confirmDelete.ts": "Utility wrapper for a confirmation dialog before deletions.",
  "frontend/src/utils/iiProviderShim.ts": "Sets a safe Internet Identity provider URL from Vite env or a default fallback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, and enabling plugins.",
  "project_state.json": "Project metadata including existing features, requirements, and state version."
}