{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Lists implemented features, affected files, components, and test IDs for currency updates, catalog changes, and UI controls.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file related to the calculator and UI styling.",
  "frontend/index.css": "Tailwind base/styles defining OKLCH color variables and themes for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App root component rendering the TotalAmountCalculatorPage.",
  "frontend/src/features/calculator/catalog.ts": "Defines CatalogItem type and the predefined list of Indian food items with INR prices and categories.",
  "frontend/src/features/calculator/format.ts": "Utilities for formatting numbers and currency using en‑IN and INR.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "UI for browsing, filtering, adding, deleting, and toggling out‑of‑stock catalog items with INR price display.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page managing line items, catalog interactions, tax/discount inputs, and total breakdown.",
  "frontend/src/features/calculator/types.ts": "Type definitions for line items, calculator state, and calculation breakdown.",
  "frontend/src/features/calculator/utils.ts": "Helper functions for parsing numbers, clamping values, and computing subtotals, tax, discounts, and totals.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, loading stored identities, and handling login/logout states.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive OKLCH CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors from CSS variables, container settings, animations, and plugins.",
  "project_state.json": "Stores project metadata, existing features, and requirements for a calculator app with catalog and INR support."
}