{
  "backend/main.mo": "Motoko canister implementing user profile storage with access control for viewing and saving profiles.",
  "feature_evidence.json": "Metadata describing a feature requirement asserting components using useBranchAuth must be wrapped in BranchAuthProvider.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing many frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind base styles defining color variables for light/dark themes and applying global styling rules.",
  "frontend/index.html": "Static HTML bootstrapping the React app by loading main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React component with authentication gating, view mode switching, print view handling, and provider setup.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Login gate page offering branch login and Internet Identity login options with branding layout.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Branch username/password login form that calls useBranchAuth and shows validation errors.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Displays active branch user and provides a logout button when branch-authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading state and query cache clearing on logout.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Top notice bar showing link expiration info with a copy-URL action and status feedback.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "React UI for viewing daily totals, selecting days, and displaying revenue and item quantities using data from useDailyTotal.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Hook that loads available days, selects a day, and computes its total revenue and item quantities from stored ledger and summaries.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "LocalStorage-based ledger utilities for storing bill entries, computing daily summaries, and managing per-day revenue.",
  "frontend/src/features/calculator/billCode.ts": "Generates a unique bill code using timestamp components and a random suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem type and a predefined list of food items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Provides currency and number formatting helpers for INR with two decimal places.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Implements label normalization, matching line items by name, and counting quantities for catalog items.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "Component for browsing, searching, grouping, and managing predefined catalog items with support for adding, deleting, and image uploads.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Type definitions for catalog component props including item lists and callbacks.",
  "frontend/src/features/calculator/PrintBill.tsx": "Print-only bill receipt component rendering line items and totals with formatting.",
  "frontend/src/features/calculator/savedBills.ts": "Handles saving, loading, retrieving, and clearing bill records in localStorage.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page managing line items, catalog interactions, totals computation, and bill saving to ledger.",
  "frontend/src/features/calculator/types.ts": "Defines types for line items, calculator state, and calculation breakdowns.",
  "frontend/src/features/calculator/utils.ts": "Provides numeric parsing, clamping, and calculation utilities for totals, tax, discounts, and subtotals.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Reads an image file using FileReader and returns a data URL with validation and error handling.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "UI page allowing users to configure receipt style, upload a payment scan, and save default bill settings.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Loads and saves default bill formatting settings to localStorage with validation.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines available receipt styles and their metadata, including the default style.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook to load, save, and optionally sync bill format defaults with a backend user profile.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "Syncs bill print location from backend user profile to local defaults when authenticated.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill, triggers automated printing, handles completion flow, and provides manual print fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBranchAuth.tsx": "Provides simple branch-level username/password auth with localStorage persistence via React context.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Offers a hook to copy the current page URL using Clipboard API with fallback and status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login/logout state management using Dfinity AuthClient and provides identity context.",
  "frontend/src/hooks/useQueries.ts": "Defines a query hook to fetch the caller's user profile once an actor is available.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, dark mode settings, and print-specific rules.",
  "frontend/src/main.tsx": "Bootstraps the app with React, InternetIdentityProvider, and React Query client.",
  "frontend/src/utils/confirmDelete.ts": "Shows a confirmation dialog before deleting an item.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL or session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, and enabling plugins.",
  "project_state.json": "Represents project metadata, architectural notes, known issues, and feature requests."
}