{
  "backend/main.mo": "Motoko actor with access control that stores user profiles, allowing users to save their own profile and admins to view others' profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files for reference.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables for light/dark modes and applying base body styling.",
  "frontend/index.html": "HTML entry point that sets the page title and loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling view routing, print mode detection, header navigation, and page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Notice bar component showing a draft-link warning with a button to copy the current URL.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Daily Totals view showing selectable days, total revenue, and per‑item quantity breakdown using stored ledger data.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "React hook that loads available ledger days, selects a day, and computes that day's total revenue and item quantities.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "LocalStorage-backed utilities for storing ledger entries, computing daily totals, and managing persisted daily summaries.",
  "frontend/src/features/calculator/billCode.ts": "Generates a unique timestamped bill code with a 4‑character suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem interface and provides a predefined list of menu items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Provides helpers for formatting numbers and currency in INR style.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Provides helpers to normalize labels, find matching line items, and sum quantities for a catalog item.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "UI component for browsing, filtering, grouping, and managing predefined catalog items, including adding new items and handling images.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Type definitions for the PredefinedItemCatalog component’s props and callbacks.",
  "frontend/src/features/calculator/PrintBill.tsx": "Print-only bill receipt component that renders line items and the totals breakdown for printing.",
  "frontend/src/features/calculator/savedBills.ts": "Manages saving, retrieving, and clearing bill records in localStorage with generated IDs and timestamps.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page handling line items, catalog interactions, totals calculation, bill saving, and ledger updates.",
  "frontend/src/features/calculator/types.ts": "Defines types for line items, calculator state, and calculation breakdowns.",
  "frontend/src/features/calculator/utils.ts": "Implements number parsing, clamping, line total calculation, subtotal computation, and full bill breakdown.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Reads an image file and returns its data URL or errors if invalid.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "UI page for configuring default receipt settings, uploading payment scans, and saving preferences.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Loads and saves bill format defaults to localStorage with validation and fallback behavior.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines available receipt styles and the default style.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook for loading and updating bill format defaults.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill, triggers printing, and manages loading, error, and post-print states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Provides a helper to copy the current URL using clipboard APIs with fallback handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider wrapping Dfinity AuthClient to manage Internet Identity login, stored identities, and login status flags.",
  "frontend/src/index.css": "Tailwind base styles with CSS variables for light/dark themes plus print-specific formatting rules.",
  "frontend/src/main.tsx": "App entry point that mounts React, wraps it with React Query and the InternetIdentityProvider, and loads global styles.",
  "frontend/src/utils/confirmDelete.ts": "Simple helper showing a confirmation dialog before deletion.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, persisting them in sessionStorage, and manipulating hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors and radii based on CSS variables and enabling additional plugins.",
  "project_state.json": "JSON describing the project’s bill‑printing enhancements, requirements, and stored architectural notes."
}