{
  "backend/main.mo": "Motoko canister managing user profiles with access control, allowing authorized users to save and query profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes with global styling rules.",
  "frontend/index.html": "HTML entry point setting the app title and mounting the React application.",
  "frontend/src/App.tsx": "Main React app with view mode switching, print view handling, and shared layout elements like header and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Notice bar displaying a guidance message with a copy-URL button and status feedback.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Daily Totals page showing selectable days, total revenue, and per-item quantities in a formatted UI.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Hook that loads available days, computes daily totals from summaries, and aggregates item quantities for selected days.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "Provides localStorage-based ledger and daily summary utilities for saving bill totals and computing daily revenue.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem type and a predefined list of menu items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Provides currency and numeric formatting helpers using Indian locale rules.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Implements matching logic between catalog items and line items, including normalization and quantity aggregation.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "React component for displaying, filtering, grouping, and managing predefined catalog items, including adding custom items and handling images.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Defines props for the PredefinedItemCatalog component, including callbacks for item actions and image updates.",
  "frontend/src/features/calculator/PrintBill.tsx": "Renders a print-friendly bill view with line items, totals, and receipt formatting.",
  "frontend/src/features/calculator/savedBills.ts": "Handles saving, loading, retrieving, and clearing bill records in localStorage.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page managing line items, catalog actions, totals, printing, and saving bills to storage and ledger.",
  "frontend/src/features/calculator/types.ts": "Defines core types for line items, calculator state, and calculation breakdowns.",
  "frontend/src/features/calculator/utils.ts": "Provides numeric parsing, clamping, and functions to compute line totals, subtotals, and full tax/discount breakdowns.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Reads an image File into a data URL using FileReader with validation and error handling.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill, triggers printing, handles print completion, and displays loading, error, or completion states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Provides a hook to copy the current page URL using the clipboard API with fallbacks and status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication state, login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode values, and print-specific stylesheet rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/src/utils/confirmDelete.ts": "Shows a confirmation dialog for deletions and returns the user’s choice.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with class-based dark mode, custom OKLCH color tokens, radius presets, and animation/typography/container-query plugins.",
  "project_state.json": "Stores the app’s project state, goals, features, and architecture notes for a billing app with catalog, print flow, and daily totals tracking."
}