{
  "backend/main.mo": "Motoko canister managing user profiles and branch‑scoped daily totals with strict authorization and per‑user isolation.",
  "feature_evidence.json": "Feature evidence report mapping print‑flow and daily‑total behaviors to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend calculator, catalog, auth, and balance sheet files.",
  "frontend/index.css": "Global styling and OKLCH‑based theming with light/dark modes and print‑optimized CSS rules.",
  "frontend/index.html": "Root HTML page loading the React app with the updated product title.",
  "frontend/src/App.tsx": "Main app shell handling branch authentication gating, view switching, print mode routing, and startup error handling.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that captures render failures and external startup errors and displays a fallback screen.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Renders the authentication landing page with branch login and optional Internet Identity login, plus app branding and footer.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Provides a controlled form for branch username/password login with validation, error handling, and submit-state control.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Shows the active branch session and provides a logout button when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with detailed error handling, UI states, and React Query cache clearing.",
  "frontend/src/components/CrashFallbackScreen.tsx": "UI for fatal errors showing an alert, error message, and reload button.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Top notice bar warning about draft links with a copy‑URL button and status feedback.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Displays daily revenue totals and item quantities, with UI to clear all stored data and feedback for success or errors.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Custom hook that loads available days and daily totals from backend or localStorage, syncing with branch changes and storage events.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "Utility functions for managing branch-scoped daily ledgers and summaries in localStorage, including load, save, clear, and summary computation.",
  "frontend/src/features/calculator/billCode.ts": "Creates a uniquely formatted bill code using timestamp and random suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem interface and a predefined list of food items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Utility functions for formatting currency and numbers in INR style.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Provides helpers for matching catalog items to line items and computing added quantities.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "React component for browsing, searching, grouping, and managing catalog items, including adding items to the bill and handling item images.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Defines props for the PredefinedItemCatalog component, including item lists and callbacks for item actions.",
  "frontend/src/features/calculator/PrintBill.tsx": "Generates a printable bill layout showing line items, totals, taxes, discounts, and a receipt header/footer.",
  "frontend/src/features/calculator/savedBills.ts": "Handles saving, retrieving, and clearing bill records in branch-scoped localStorage.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page managing line items, catalog interactions, totals, bill saving, and printing.",
  "frontend/src/features/calculator/types.ts": "Defines core types for line items, calculator state, and total breakdowns.",
  "frontend/src/features/calculator/utils.ts": "Utility functions for parsing numbers, clamping values, and calculating line totals and bill breakdowns.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Converts an image File into a data URL using FileReader, validating type and handling errors.",
  "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts": "Defines fixed print-location logic for specific branches and helpers to enforce or retrieve those fixed addresses.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "UI page for configuring default bill settings including receipt style, payment scan image, and print location with branch-based restrictions.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Loads and saves bill format defaults in branch-scoped localStorage, enforcing fixed branch print addresses and providing fallbacks.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines available receipt styles and the default style for bill printing.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook that loads, updates, and saves bill default settings locally and syncs print location to backend when authenticated.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "Syncs bill print location from backend profile into branch-scoped local defaults unless the branch has a fixed address.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill by ID for rendering and printing, applying receipt style and auto-print behavior with error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBranchAuth.tsx": "Implements simple branch-based login, storing user selection in localStorage and migrating data per branch.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Provides a helper to copy the current page URL to the clipboard with status feedback.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, and status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls for user profiles, daily totals, balance sheets, and related mutations with cache invalidation.",
  "frontend/src/hooks/useStartupFailureHandlers.ts": "Hook that listens for unhandled errors and promise rejections during startup and stores the first encountered error message.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode values, and print-specific styling rules.",
  "frontend/src/main.tsx": "App entry point that mounts the React tree with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/branchScopedStorage.ts": "Utilities for generating and managing branch-scoped localStorage keys, including migration from legacy global keys.",
  "frontend/src/utils/confirmDelete.ts": "Simple wrappers around window.confirm for delete and clear-all confirmation prompts.",
  "frontend/src/utils/iiProviderShim.ts": "Shim that sets a safe default Internet Identity provider URL using Vite env vars or a production fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them to sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with extended theme colors, radii, and plugins for animations, typography, and container queries.",
  "project_state.json": "Stores project state metadata, including a regression issue related to the Print Bill action and feature requests to restore previous print behavior while keeping side effects intact."
}