{
  "backend/main.mo": "Actor with access-controlled user profile storage supporting get and save operations keyed by caller principal.",
  "feature_evidence.json": "Feature evidence report mapping a quick-add item behavior to related frontend files, components, and test ID.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global background/foreground rules.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the React app root and main script.",
  "frontend/src/App.tsx": "Main application component handling print mode, view switching between calculator and daily totals, and layout structure.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity with login/logout handling and loading states.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Daily totals UI showing selectable days, revenue summary, and per‑item quantity table.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "React hook computing available ledger days, selected day totals, and aggregated per‑item quantities from saved bills.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "LocalStorage-based daily ledger utilities for saving, loading, and aggregating bill totals and item quantities.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem type and a predefined list of menu items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Provides number and currency formatting helpers for INR values.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Helpers for normalizing labels, matching catalog items to line items, and computing added quantities.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "React component that displays searchable, categorized catalog items and allows adding, creating, deleting, and marking items out of stock.",
  "frontend/src/features/calculator/PrintBill.tsx": "Print-only component that renders a formatted bill with line items and totals for printing.",
  "frontend/src/features/calculator/savedBills.ts": "LocalStorage-based utilities to save, load, list, and clear saved bill records.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page managing line items, catalog interactions, totals calculation, bill saving, and printing.",
  "frontend/src/features/calculator/types.ts": "Type definitions for line items, calculator state, and calculation breakdown.",
  "frontend/src/features/calculator/utils.ts": "Provides number parsing, clamping, and functions to compute line totals, subtotals, and full tax/discount breakdowns.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill by URL ID and manages automatic print flow, error handling, and post-print completion UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity persistence, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, dark mode values, and print-specific styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, custom radii, and loads additional plugins.",
  "project_state.json": "Stores the project’s current version, feature set, architectural notes, and requirements for a calculator app with catalog, billing, daily totals, and themed UI. Tracks print-flow behavior, item-handling rules, and other ongoing design constraints."
}