{
  "backend/main.mo": "Motoko actor with access‑controlled user profile storage allowing users to save and retrieve their own profiles, with admin‑allowed cross‑profile reads.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color tokens for light and dark modes plus base styling rules.",
  "frontend/index.html": "App entry HTML defining root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app that gates all features behind branch authentication and renders calculator, daily totals, or print views.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Gate screen requiring branch login and optionally offering Internet Identity connection.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Branch login form that trims inputs, validates hardcoded credentials, and shows errors on failed login.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Displays current branch session info with a logout button when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component handling Internet Identity auth flow, error states, and query cache clearing.",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Notice bar offering a copy‑URL button with success/error feedback for sharing links.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "UI for viewing daily totals, selecting days, and displaying revenue and item quantities.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Hook that loads available days, selected day, and computes daily revenue and per‑item quantities from ledger data.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "LocalStorage utilities for storing ledger entries, computing daily summaries, and retrieving per‑day bill data.",
  "frontend/src/features/calculator/billCode.ts": "Generates a timestamp-based bill code with a 4‑char random suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines the CatalogItem interface and a predefined menu of items with prices and categories.",
  "frontend/src/features/calculator/format.ts": "Provides currency and number formatting helpers using INR locale.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Functions to normalize labels, find matching line items, and count quantities for catalog items.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "Catalog UI for searching, grouping, adding, editing, and managing predefined bill items with optional images.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "Type definitions for the PredefinedItemCatalog component’s props and callbacks.",
  "frontend/src/features/calculator/PrintBill.tsx": "Printable bill layout showing line items, totals breakdown, and receipt header/footer.",
  "frontend/src/features/calculator/savedBills.ts": "Manages saving, loading, and clearing bill records in localStorage.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator UI managing line items, catalog adds, totals, and saving/printing bills.",
  "frontend/src/features/calculator/types.ts": "Defines types for line items, calculator state, and calculation breakdown.",
  "frontend/src/features/calculator/utils.ts": "Utility functions for parsing, clamping, and computing totals, tax, discount, and breakdowns.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Reads an image file into a data URL string with validation and error handling.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "UI page for configuring default receipt style, payment scan image, and print address.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Loads and saves bill format defaults to localStorage with validation.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines available receipt style options and the default style.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook to load, save, and optionally sync bill format defaults with backend.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "Syncs bill print location from the user profile to local storage defaults, updating only when values differ.",
  "frontend/src/features/print/PrintViewPage.tsx": "Loads a saved bill and manages automatic and manual printing flow with cleanup and completion handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBranchAuth.tsx": "Provides simple localStorage‑backed branch login with hardcoded credentials and basic auth state.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Offers a function to copy the current URL using the clipboard API with fallback and status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, loading identities, handling login, and exposing identity context.",
  "frontend/src/hooks/useQueries.ts": "Fetches the current user's profile using the backend actor, syncing loading state with actor availability.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and print‑optimized CSS rules.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/confirmDelete.ts": "Utility that shows a browser confirm dialog before deleting an item.",
  "frontend/src/utils/iiProviderShim.ts": "Ensures a safe default Internet Identity provider URL by setting process.env.II_URL from Vite or fallback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to get, store, retrieve, and clear URL and session parameters, including hash-based parsing and persistence logic.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, color variables, border radii, and additional plugins.",
  "project_state.json": "Defines the project’s state, including login requirements, known issues, and pending feature requests for gated authentication."
}