{
  "backend/main.mo": "Main backend actor implementing user profiles, daily totals with branch-scoped storage (key format: branch:principal:date), balance sheet queries, and access control integration using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping four white-screen crash investigation and fix features to their implementation files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend source files covering calculator, balance sheet, catalog, authentication, and print functionality with branch-scoped storage and backend integration details.",
  "frontend/index.css": "Global Tailwind styles with OKLCH color system (red primary hue 25, yellow accent hue 85) for light/dark modes and print media queries hiding non-bill UI elements.",
  "frontend/index.html": "HTML entry point with document title \"Varshini Classic Cuisine\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup (defensive null checks, fallback UI on router failure), branch authentication gate, Layout with header/nav/footer, and four routes (calculator, balance sheet, optimize bill, print view).",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches render errors and external startup failures, logging details to console and displaying CrashFallbackScreen with error info.",
  "frontend/src/components/auth/AuthGatePage.tsx": "Landing page component that renders the branch login form and an optional Internet Identity login button, with branding and footer.",
  "frontend/src/components/auth/BranchLoginForm.tsx": "Form component for branch authentication that accepts username and password, normalizes credentials, and calls the useBranchAuth login function.",
  "frontend/src/components/auth/BranchSessionControl.tsx": "Displays the currently logged-in branch user and provides a logout button using the useBranchAuth hook.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component for Internet Identity authentication that toggles between login and logout states, clearing the query cache on logout.",
  "frontend/src/components/CrashFallbackScreen.tsx": "Fallback UI component displaying error message, stack traces (error and component), environment info, and reload button that clears localStorage except preserved keys (branchAuthUser).",
  "frontend/src/components/GuidanceNoticeBar.tsx": "Displays a banner warning that draft links may expire, with a button to copy the current URL to clipboard using the useCopyCurrentUrl hook.",
  "frontend/src/features/balanceSheet/BalanceSheetView.tsx": "Main view for displaying daily revenue totals and item quantities with day selection, plus a destructive action to clear all daily totals with confirmation and status feedback.",
  "frontend/src/features/balanceSheet/hooks/useDailyTotal.ts": "Custom hook that manages daily total state, fetching data from backend balance sheet API with localStorage fallback, and listens for storage changes scoped to the current branch.",
  "frontend/src/features/balanceSheet/ledgerUtils.ts": "Utility functions for managing branch-scoped daily revenue ledgers and summaries in localStorage, including loading, saving, computing totals, and clearing cache.",
  "frontend/src/features/calculator/billCode.ts": "Utility function that generates unique bill codes in format BILL-YYYYMMDD-HHMMSS-XXXX with date, time, and random alphanumeric suffix.",
  "frontend/src/features/calculator/catalog.ts": "Defines CatalogItem interface and PREDEFINED_CATALOG constant containing restaurant menu items organized by categories (South Indian, North Indian, Rice, Curries, Snacks, Beverages, Desserts) with prices and stock status.",
  "frontend/src/features/calculator/format.ts": "Currency and number formatting utilities using Intl.NumberFormat for INR currency display with proper thousand separators and decimal places.",
  "frontend/src/features/calculator/lineItemCatalogMatching.ts": "Utilities for case-insensitive matching between catalog items and line items, including functions to find matching items and calculate total quantities added to bill.",
  "frontend/src/features/calculator/PredefinedItemCatalog.tsx": "React component that displays a searchable catalog of predefined items grouped by category, with functionality to add items to bill, manage out-of-stock status, handle item images, and create new custom catalog items.",
  "frontend/src/features/calculator/PredefinedItemCatalog.types.ts": "TypeScript interface definition for PredefinedItemCatalog component props, including handlers for adding, deleting, toggling stock status, and managing item images.",
  "frontend/src/features/calculator/PrintBill.tsx": "React component that renders a print-only formatted bill receipt with line items table, tax/discount breakdown, and restaurant header/footer for physical printing.",
  "frontend/src/features/calculator/savedBills.ts": "LocalStorage persistence layer for saving and retrieving bill records with branch-scoped storage, including bill format snapshots and calculation breakdowns.",
  "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx": "Main calculator page component managing bill state with line items, tax, discounts, catalog integration, and actions to save bills, update ledger, and print receipts with branch authentication.",
  "frontend/src/features/calculator/types.ts": "Core TypeScript type definitions for calculator feature including LineItem, CalculatorState, and CalculationBreakdown interfaces.",
  "frontend/src/features/calculator/utils.ts": "Calculation utilities for line items including safe number parsing, subtotal calculation, tax/discount application, and breakdown computation with validation.",
  "frontend/src/features/calculator/utils/readImageFileAsDataUrl.ts": "Utility function that reads an image File object and converts it to a data URL string using FileReader, with validation and error handling.",
  "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts": "Utility module that enforces fixed print location addresses for specific branch users (bachupally, nezampat), preventing user or backend overrides.",
  "frontend/src/features/optimizeBill/OptimizeBillPage.tsx": "React component page for configuring bill format defaults (receipt style, payment scan image, print location address) with special handling for fixed-branch users who cannot change their print location.",
  "frontend/src/features/optimizeBill/optimizeBillStorage.ts": "Handles loading and saving bill format defaults to branch-scoped localStorage, enforcing fixed print locations for applicable branches.",
  "frontend/src/features/optimizeBill/receiptStyles.ts": "Defines receipt style types ('classic' and 'compact') with their metadata and default style constant.",
  "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts": "React hook that manages bill format defaults, loading from localStorage on mount and saving to both localStorage and backend (if authenticated) while enforcing fixed branch addresses.",
  "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts": "React hook that syncs bill print location from backend user profile to branch-scoped localStorage on authentication, skipping sync for fixed-branch users.",
  "frontend/src/features/print/PrintViewPage.tsx": "React component that displays a printable bill view loaded from branch-scoped storage by ID, with auto-print functionality and manual print controls.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBranchAuth.tsx": "React context provider and hook for branch-based authentication with hardcoded credentials, persisting login state to localStorage and triggering data migration on login/hydration.",
  "frontend/src/hooks/useCopyCurrentUrl.ts": "Custom React hook that copies the current browser URL to clipboard using modern Clipboard API with fallback to legacy execCommand, returning copy status (idle/success/error).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend canister operations including user profile management, daily totals CRUD, and balance sheet retrieval with automatic cache invalidation.",
  "frontend/src/hooks/useStartupFailureHandlers.ts": "React hook that captures and stores unhandled promise rejections and global errors during application startup for error display.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, sidebar styling, and print media styles optimized for A4 page printing.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/branchScopedStorage.ts": "Utility functions for branch-namespaced localStorage keys with one-time migration from legacy global keys to branch-scoped storage for multi-branch data isolation.",
  "frontend/src/utils/confirmDelete.ts": "Simple utility functions that show browser confirmation dialogs before deleting items or clearing all daily totals data.",
  "frontend/src/utils/iiProviderShim.ts": "Shim that resolves Internet Identity provider URL from Vite environment variable or defaults to production IC URL, setting process.env.II_URL for compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color scheme using OKLCH color space, extended border radius variables, and plugins for animations, typography, and container queries.",
  "project_state.json": "Project state tracking file documenting a white screen crash bug in the deployed version, with features focused on investigating error boundaries, environment configurations, and router initialization error handling."
}