{
  "kind": "build_request",
  "title": "Lock print location address for specific branch usernames",
  "projectName": "Daily Totals Ledger",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When the authenticated branch username is exactly \"bachupally\", force the bill print location address value to be exactly \"bachupally\" across the app, regardless of any existing localStorage or backend profile value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "for username bachupally keep the address constent as bachupally and for nezampat as nezampat"
        ]
      },
      "acceptanceCriteria": [
        "After logging in as branch user \"bachupally\", the Optimize Bill > Print Location Address field value is \"bachupally\".",
        "If localStorage or backend has any other value for the print location address, it is overridden to \"bachupally\" for branch user \"bachupally\".",
        "Saving defaults while logged in as \"bachupally\" persists \"bachupally\" as the print location address (and does not persist any other value)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the authenticated branch username is exactly \"nezampat\", force the bill print location address value to be exactly \"nezampat\" across the app, regardless of any existing localStorage or backend profile value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "for username bachupally keep the address constent as bachupally and for nezampat as nezampat"
        ]
      },
      "acceptanceCriteria": [
        "After logging in as branch user \"nezampat\", the Optimize Bill > Print Location Address field value is \"nezampat\".",
        "If localStorage or backend has any other value for the print location address, it is overridden to \"nezampat\" for branch user \"nezampat\".",
        "Saving defaults while logged in as \"nezampat\" persists \"nezampat\" as the print location address (and does not persist any other value)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Optimize Bill UI so that the Print Location Address input is not editable for branch users \"bachupally\" and \"nezampat\" and clearly indicates it is fixed for that branch (user-facing text must be in English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "for username bachupally keep the address constent as bachupally and for nezampat as nezampat"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as \"bachupally\" or \"nezampat\", the Print Location Address input is disabled or read-only and cannot be changed by typing.",
        "When logged in as any other branch user (if any are added later), the Print Location Address input remains editable as before.",
        "Any helper/description text added to indicate the field is fixed is in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure sync and persistence logic cannot overwrite the fixed branch address: (a) backend-to-local sync must not replace the fixed address for \"bachupally\"/\"nezampat\", and (b) saving defaults must always write the fixed value for these branches to both localStorage and (when available) the backend user profile billPrintLocation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "for username bachupally keep the address constent as bachupally and for nezampat as nezampat"
        ]
      },
      "acceptanceCriteria": [
        "For \"bachupally\"/\"nezampat\", useSyncBillPrintLocation does not change the local printLocationAddress away from the branch-fixed value even if the backend user profile contains a different value.",
        "For \"bachupally\"/\"nezampat\", useOptimizeBillDefaults.saveDefaults persists the branch-fixed print location address to localStorage even if the UI state contains a different value.",
        "For \"bachupally\"/\"nezampat\", if backend saving occurs, the saved UserProfile.billPrintLocation equals the fixed branch value."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI components).",
    "Do not modify the immutable hook files listed in SYSTEM_CONTEXT (compose around them instead).",
    "Backend must remain a single-actor Motoko canister; only introduce migration changes if state schema changes are required (not expected for this request)."
  ],
  "nonGoals": [
    "Adding new branch usernames/passwords or changing existing branch credentials.",
    "Implementing third-party authentication or changing authentication flows.",
    "Changing daily totals persistence behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}