{
  "kind": "build_request",
  "title": "Merge duplicate catalog-added line items by incrementing quantity",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "When a user adds an item from the Quick Add Items catalog and that same item already exists in the current bill’s line items, do not create a new duplicate line item; instead, increment the existing matching line item’s quantity by 1.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "in the line items if an item and the same item is added again then don't add it again but add it in the quantity"
        ]
      },
      "acceptanceCriteria": [
        "Given the current bill already contains a line item with label matching the selected catalog item name (case-insensitive, trimmed), clicking the catalog item’s Add button increases that existing line item’s quantity by 1.",
        "When a matching line item is found and incremented, the total number of line items does not increase.",
        "If no matching line item exists, clicking Add creates a new line item with quantity = 1 and unitPrice = the catalog item’s unitPrice (current behavior).",
        "Out-of-stock catalog items remain blocked from being added (no new line item is created and no quantity is incremented).",
        "The catalog’s per-item added-count badge continues to reflect the correct total quantity for that item after repeated Add clicks."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the current single-page calculator behavior and existing print/daily-totals flows unchanged aside from how catalog Add merges quantities."
  ],
  "nonGoals": [
    "Do not implement any backend changes for this behavior.",
    "Do not change how manual line item entry/label editing dedupes items unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}