{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Branch-fixed bill print location (bachupally/nezampat)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Force print location address to \"bachupally\" for authenticated branch user bachupally across the app, overriding any stored values.",
      "acceptanceCriteria": [
        "After logging in as branch user \"bachupally\", the Optimize Bill > Print Location Address field value is \"bachupally\".",
        "If localStorage or backend has any other value for the print location address, it is overridden to \"bachupally\" for branch user \"bachupally\".",
        "Saving defaults while logged in as \"bachupally\" persists \"bachupally\" as the print location address (and does not persist any other value)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts",
          "operation": "create",
          "description": "Add a small shared utility that maps fixed branch usernames to their enforced bill print location address (e.g., bachupally -> bachupally) and exposes helper functions to detect and apply the fixed value. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/optimizeBill/optimizeBillStorage.ts",
          "operation": "modify",
          "description": "Enforce the fixed address for branch user \"bachupally\" at the storage layer by (1) overriding loadBillFormatDefaults(branch) to return printLocationAddress=\"bachupally\" for that branch regardless of stored value, and (2) overriding saveBillFormatDefaults(defaults, branch) to always write printLocationAddress=\"bachupally\" for that branch even if a different value is passed in."
        },
        {
          "path": "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts",
          "operation": "modify",
          "description": "Ensure saveDefaults always persists the enforced \"bachupally\" print location for the bachupally branch when saving to localStorage and when optionally saving to the backend profile (billPrintLocation), even if the caller passes a different value."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Force print location address to \"nezampat\" for authenticated branch user nezampat across the app, overriding any stored values.",
      "acceptanceCriteria": [
        "After logging in as branch user \"nezampat\", the Optimize Bill > Print Location Address field value is \"nezampat\".",
        "If localStorage or backend has any other value for the print location address, it is overridden to \"nezampat\" for branch user \"nezampat\".",
        "Saving defaults while logged in as \"nezampat\" persists \"nezampat\" as the print location address (and does not persist any other value)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts",
          "operation": "modify",
          "description": "Extend the fixed-branch mapping utility to include nezampat -> nezampat and expose a single source of truth for both fixed branches. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/optimizeBill/optimizeBillStorage.ts",
          "operation": "modify",
          "description": "Enforce the fixed address for branch user \"nezampat\" at the storage layer by (1) overriding loadBillFormatDefaults(branch) to return printLocationAddress=\"nezampat\" for that branch regardless of stored value, and (2) overriding saveBillFormatDefaults(defaults, branch) to always write printLocationAddress=\"nezampat\" for that branch even if a different value is passed in."
        },
        {
          "path": "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts",
          "operation": "modify",
          "description": "Ensure saveDefaults always persists the enforced \"nezampat\" print location for the nezampat branch when saving to localStorage and when optionally saving to the backend profile (billPrintLocation), even if the caller passes a different value."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make Print Location Address non-editable for bachupally/nezampat and show an English indication that the value is fixed for the branch.",
      "acceptanceCriteria": [
        "When logged in as \"bachupally\" or \"nezampat\", the Print Location Address input is disabled or read-only and cannot be changed by typing.",
        "When logged in as any other branch user (if any are added later), the Print Location Address input remains editable as before.",
        "Any helper/description text added to indicate the field is fixed is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/optimizeBill/OptimizeBillPage.tsx",
          "operation": "modify",
          "description": "Use the branch-fixed mapping utility to: (1) set the Print Location Address input value from the fixed branch value when applicable, (2) render the input as disabled/read-only for bachupally/nezampat, and (3) add clear English helper text indicating the address is fixed for that branch. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/optimizeBill/branchFixedPrintLocation.ts",
          "operation": "modify",
          "description": "Provide UI-friendly helpers (e.g., isFixedBranchUser, getFixedPrintLocationForBranchUser) so OptimizeBillPage can disable the input and display the correct fixed value without duplicating logic. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prevent sync/persistence logic from overwriting fixed branch addresses; always persist the fixed value to localStorage and backend profile when saving defaults.",
      "acceptanceCriteria": [
        "For \"bachupally\"/\"nezampat\", useSyncBillPrintLocation does not change the local printLocationAddress away from the branch-fixed value even if the backend user profile contains a different value.",
        "For \"bachupally\"/\"nezampat\", useOptimizeBillDefaults.saveDefaults persists the branch-fixed print location address to localStorage even if the UI state contains a different value.",
        "For \"bachupally\"/\"nezampat\", if backend saving occurs, the saved UserProfile.billPrintLocation equals the fixed branch value."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/optimizeBill/useSyncBillPrintLocation.ts",
          "operation": "modify",
          "description": "Guard the backend-to-local sync so that when the branch user is bachupally or nezampat, the sync does not apply backend billPrintLocation values that differ from the enforced branch-fixed value (and ideally no-ops early for those branches)."
        },
        {
          "path": "frontend/src/features/optimizeBill/useOptimizeBillDefaults.ts",
          "operation": "modify",
          "description": "When saving defaults for bachupally/nezampat, force the printLocationAddress used for local save, state update, and optional backend profile save to the branch-fixed value (ensuring backend UserProfile.billPrintLocation matches the fixed value)."
        },
        {
          "path": "frontend/src/features/optimizeBill/optimizeBillStorage.ts",
          "operation": "modify",
          "description": "Make fixed-branch enforcement tamper-resistant by ensuring both load and save paths cannot return/persist a non-fixed printLocationAddress for bachupally/nezampat, preventing accidental overwrites from any caller (including sync logic)."
        }
      ]
    }
  ]
}