{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Merge duplicate Quick Add catalog items by incrementing existing line item quantity",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "When adding a catalog item that already exists in the bill (label match case-insensitive + trimmed), increment quantity instead of creating a duplicate line item.",
      "acceptanceCriteria": [
        "Given the current bill already contains a line item with label matching the selected catalog item name (case-insensitive, trimmed), clicking the catalog item’s Add button increases that existing line item’s quantity by 1.",
        "When a matching line item is found and incremented, the total number of line items does not increase.",
        "If no matching line item exists, clicking Add creates a new line item with quantity = 1 and unitPrice = the catalog item’s unitPrice (current behavior).",
        "Out-of-stock catalog items remain blocked from being added (no new line item is created and no quantity is incremented).",
        "The catalog’s per-item added-count badge continues to reflect the correct total quantity for that item after repeated Add clicks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/calculator/lineItemCatalogMatching.ts",
          "operation": "modify",
          "description": "Add a shared utility that finds a matching existing line item for a given catalog item name using the same normalization rules (case-insensitive, trimmed), so Quick Add can increment quantity without creating duplicates."
        },
        {
          "path": "frontend/src/features/calculator/TotalAmountCalculatorPage.tsx",
          "operation": "modify",
          "description": "Update the Quick Add handler (addCatalogItem) to: (1) keep blocking out-of-stock items, (2) search for an existing matching line item by normalized label, (3) increment that line item’s quantity by 1 when found without changing the line item count, and (4) otherwise append a new line item with quantity=1 and unitPrice=catalogItem.unitPrice. Keep all other calculator/print/daily-totals behaviors unchanged."
        }
      ]
    }
  ]
}